20220406085251-automate_decisions_about_what_to_work_on.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-12 Thu 08:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Choose what to work on</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Choose what to work on</h1>
<p>
When you have <a href="20211202104804-what_i_am_working_on.html#ID-9980ae28-68d4-4e29-9248-d661ccd85ab8">many interests</a> the process of choosing what to work on next can be overwhelming. Most people implicitly delegate this process: do whatever most important person wants me to do. This removes pressure off of one's shoulders, and this is the idea behing organization systems like Getting Things Done: wear your planner hat every evening / Friday evening and execute the rest of the time. But that works well in a system where there are external reasons to prioritize some items. What GTD, etc. are planning for is <i>execution</i>, not plannification itself.
</p>

<p>
I however, pursue many activities for which I have no external pressure, with unpredictable rewards:
</p>
<ul class="org-ul">
<li>Writing / completing / connecting <a href="20220406085650-zetteltasken.html#ID-949cbc09-832b-40da-b5b6-771a880f7be3">Zetteltasken</a> notes;</li>
<li>Working on <a href="blog/index.html">blog posts</a>. I have a <a href="inbox.html#ID-c459d931-433c-4dfe-a21d-01f271431441">list of topics</a> that I'd like to write about, but no clear priority;</li>
<li>Working on notebooks;</li>
<li>Elaborating on topics I've accumulated for creative writing</li>
<li>What to read out of my reading list (although <a href="20220406085753-items_in_your_reading_list_should_be_turned_into_notes.html#ID-52c3a31f-0fff-49cd-a2bb-244bf0f6d040">each reading item could be made into a new note</a>)</li>
<li>What open source projects to focus on a particular week;</li>
</ul>

<p>
It mostly does not matter how the next task is chosen. In this case I think that asking the computer to choose for you helps avoid <a target='_blank' rel='noopener noreferrer' class='external' href="https://en.wikipedia.org/wiki/Overchoice">choice overload</a>, frequent among knowledge workers.
</p>

<p>
The tool of choice here is <i>spaced repetition</i>, which is mostly used to learn stuff, but can also be used as a way to develop a concept and refine it over time. <a target='_blank' rel='noopener noreferrer' class='external' href="https://ag91.github.io/blog/2020/09/04/the-poor-org-user-spaced-repetition/">this blog post</a> describes how to do it with emacs:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">my/space-repeat-if-tag-spaced</span> (e)
  <span style="color: #9FC59F;">"Resets the header on the TODO states and increases the date</span>
<span style="color: #9FC59F;">according to a suggested spaced repetition interval."</span>
  (<span style="color: #F0DFAF; font-weight: bold;">let*</span> ((spaced-rep-map '((0 . <span style="color: #CC9393;">"++1d"</span>)
                          (1 . <span style="color: #CC9393;">"++2d"</span>)
                          (2 . <span style="color: #CC9393;">"++10d"</span>)
                          (3 . <span style="color: #CC9393;">"++30d"</span>)
                          (4 . <span style="color: #CC9393;">"++60d"</span>)
                          (5 . <span style="color: #CC9393;">"++4m"</span>)))
         (spaced-key <span style="color: #CC9393;">"spaced"</span>)
         (tags (org-get-tags nil t))
         (spaced-todo-p (member spaced-key tags))
         (repetition-n (first (cdr spaced-todo-p)))
         (n+1 (<span style="color: #F0DFAF; font-weight: bold;">if</span> repetition-n (+ 1 (string-to-number (substring repetition-n (- (length repetition-n) 1) (length repetition-n)))) 0))
         (spaced-repetition-p (alist-get n+1 spaced-rep-map))
         (new-repetition-tag (concat <span style="color: #CC9393;">"repetition"</span> (number-to-string n+1)))
         (new-tags (reverse (<span style="color: #F0DFAF; font-weight: bold;">if</span> repetition-n
                                (seq-reduce
                                 (<span style="color: #F0DFAF; font-weight: bold;">lambda</span> (a x) (<span style="color: #F0DFAF; font-weight: bold;">if</span> (string-equal x repetition-n) (cons new-repetition-tag a) (cons x a)))
                                 tags
                                 '())
                              (seq-reduce
                               (<span style="color: #F0DFAF; font-weight: bold;">lambda</span> (a x) (<span style="color: #F0DFAF; font-weight: bold;">if</span> (string-equal x spaced-key) (cons new-repetition-tag (cons x a)) (cons x a)))
                               tags
                               '())))))
    (<span style="color: #F0DFAF; font-weight: bold;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">and</span> spaced-todo-p spaced-repetition-p)
      (<span style="color: #F0DFAF; font-weight: bold;">progn</span>
          <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">avoid infinitive looping</span>
          (remove-hook 'org-trigger-hook 'my/space-repeat-if-tag-spaced)
          <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">reset to previous state</span>
          (org-call-with-arg 'org-todo 'left)
          <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">schedule to next spaced repetition</span>
          (org-schedule nil (alist-get n+1 spaced-rep-map))
          <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">rewrite local tags</span>
          (org-set-tags new-tags)
          (add-hook 'org-trigger-hook 'my/space-repeat-if-tag-spaced))
        )))

(add-hook 'org-trigger-hook 'my/space-repeat-if-tag-spaced)
</pre>
</div>

<p>
which we will need to adapt to work with zetteltasken notes in org-roam.
</p>

<p>
<b>Note:</b> We can turn the implementation details into a <a href="blog/index.html">blog post</a>, as <a href="20220406091014-blog_posts_are_allowed_to_become_stale.html#ID-4d227966-7567-4261-a90d-ce0b27b18615">blog posts are allowed to become stale</a>. And use <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/nobiot/org-transclusion">Org-transclusion</a> to include related notes, including this one.
</p>

<div id="outline-container-org5215643" class="outline-2">
<h2 id="org5215643">Links to this note</h2>
</div>
</div>
</body>
</html>